
* Comments on the paper

* Empirical measurements
- Diameters:
  - Inner shell
    - 9 to 12 arcsec
    - mean 10.4 \pm 0.4
    - [[id:22069844-53A0-4130-8CF6-B86D0526053F][details here]]
  - Outer shell
    - end bits have diameter of 16 to 17 arcsec
  - Third shell (cone and fishtails)
    - 26 arcsec, but very uncertain
- Heights
  - Both shells have a sharpish outer boundary
  - Inner shell
    - 16 or so    
  - Outer shell
    - 26 or so
    - although co-added spectrum would argue for 32
- Aspect ratios: H / D
  - inner 16 / 10.4 +/- 0.4 = 1.54 +/- 0.06
  - outer 26 / 16.5 = 1.58 with large uncertainty
  - these are amazingly consistent
- Velocity splitting
  - [[id:478343AB-FDFD-4EA9-A338-FFC7B0809E0C][Details given below]]
  - Inner shell
    - 26 km/s
  - Outer shell
    - 37 km/s
  - Third shell
    - 70 km/s
  - D / V
    - Inner: 0.4
    - Outer: 0.43
    - Third: 0.37
    - So almost the same for all of them within 10%
    
** Width of inner lobes and inclination angle
:PROPERTIES:
:ID:       22069844-53A0-4130-8CF6-B86D0526053F
:END:
- Measured in ds9

|            |                |
|------------+----------------|
| core       |           9.57 |
| N bulge A  |          10.50 |
| N bulge B  |          11.69 |
| N edge     |          10.42 |
| S bulge  A |          11.52 |
| S bulge B  |          11.83 |
| S edge     |           9.14 |
| slit G     |            8.7 |
|------------+----------------|
| mean       | 10.42 +/- 0.43 |
| i          |     84. +/- 2. |
|            |                |
#+TBLFM: @10$2=vmeane(@I..@II);f2::@11$2=arccos(1.1 +/- 0.3 / @-1);f0

This is different from what I measured in the slit G of 8.7

So I now get arccos(1.1 +/- 0.3 / 10.4 +/- 0.4) = 84 +/- 2

*** More sophisticated shell measurements
- See the notebook [[file:../notebooks/04-01-coadd-slits.py][04-01-coadd-slits]] in section "Minor axis spatial profile"
- I look at fitting gaussians to the brightness profile of a thick cylindrical shell with inner, outer radii r_in, r_out
- Results as follows:
  - Gaussian peak radius is \approx r_in
  - Gaussian fwhm is \approx 1.7 (r_out - r_in)
  - So thickness H = (r_out - r_in) \approx 0.6 FWHM
  - And mean radius = 0.5 (r_out + r_in) \approx PEAK + 0.3 FWHM
- For the inner shell on the equator, I find
  - PEAK = 4.4 arcsec
  - FWHM = 7.4 arcsec
- Implying
  - r_in = 4.4 \pm 0.2
  - H = 3.7
  - r_out = 8.1 \pm 0.2
  - mean r = 6.6
  - mean diameter D = 13.2
- *So I need to reconcile this with the above measurements*
  - It means that the diameters I have above are from the peaks, so are the inner surface
    - So we all agree that this is about 9 arcsec on the equator
    - For the velocities, we need to check that the peak of the line profile corresponds to the inner edge
  

** Seeing width
- FWHM measured on the bright stars
  | image      |          fwhm |
  |------------+---------------|
  | spm0600 x  |           1.9 |
  | spm0600 y  |           1.5 |
  | spm0953 x  |           1.9 |
  | spm0953 y  |           1.5 |
  | N10035 x   |           1.4 |
  | N10035 y   |           1.4 |
  | oiii med x |           1.5 |
  | oiii med y |           1.6 |
  |------------+---------------|
  |            | 1.59 +/- 0.07 |
  |            |               |
  #+TBLFM: @10$2=vmeane(@I..@II);f2
- So varies from 1.3 to 1.9 arcsec


** Slit width


*** 150 micron slit
| image   |          fwhm |
|---------+---------------|
| spm0600 |           2.3 |
| spm0953 |           3.0 |
| spm0020 |           2.9 |
| spm1431 |           2.3 |
|---------+---------------|
|         | 2.63 +/- 0.19 |
|         |               |
#+TBLFM: @6$2=vmeane(@I..@II);f2
- So 2.6 \pm 0.2 is good enough
*** 70 micron slit
| image  | fwhm |
|--------+------|
| N10035 |  1.3 |
| N20011 |  1.4 |
|        |      |
- Strangely, this is smaller than the seeing width
* Emission measure
- From Corradi:2014j we have the observed total H alpha flux of the nebula
  - F(Hα)= 8.5 × 10−13 erg cm−2 s−1
- And radio flux
  - 3.6 ± 0.5 mJy at 1.4 GHz.
  - Supposedly
    F(Hα) = 1.73e-10 erg cm−2 s−1 (S_{1.4} / mJy)
  - I do not think this is right. It should be about 1e-12
- This means that the intrinsic Ha flux is
  - 1e-12 3.6 = 3.6e-12 = 4.2 times observed flux
- So c(H a) = log10(4.2) = 0.62
- So c(H b) = 0.62 / 0.77 = 0.80
  - whereas the paper says 1.23 +/- 0.3 for c(H b) derived in this way
  - perhaps because they are using the T = 13 kK, which will reduce the conversion factor a bit
  - From the Balmer lines they find c(Hb) = 0.95 ± 0.25 assuming R_V = 3.1
    - so intrinsic / observed Ha flux is 10**(0.95 0.77) = 5.39
    - so intrinsic flux is 4.5815e-12 erg cm−2 s−1
- Ha luminosity = 4 pi D^2 F = 5.4817e+32 D_kc^2 erg/s = 0.1435 D_kpc^2 L_sun
- Conversion to VEM
  - H alpha emissivity = 4 pi j = 3.1e-25 erg cm^3 / s
  - VEM = \int n_e n_p d V = L / 4 pi j = 1.77e+57 D_kpc^2 cm^-3 = 60.25 D_kpc^2 pc^3 cm^-6
- Total recombination rate
  - \alpha_B VEM = 3.83e+44 D_kpc^2 s^-1

* Electron density
- The [S II] density is 125 \pm 40 from Corradi
- With an angular radius of \theta in arcsec, the radius is
  R = 4.8481e-03 \theta D_kpc pc
- So this gives an alternative way of estimating the VEM
  - assuming a filling factor of f for the dense gas
- VEM = (4 pi / 3) n^2 R^3 f = 7.46e-03 \theta^3 D_kpc^3 f pc^3 cm^-6
- The flux is dominated by the inner shell, with radius \theta \approx 5 arcsec

* Radial density structure
- The inner shell is limb brightened
  - From the fits to the spatial profile along slit g, we get 
- But 

* Kinetic temperature from Ha widths
- Given the very similar distribution of the oiii and ha emission, it should be reliable to estimate the kinetic T from the Ha broadening
- We can do this from the gaussian fits along the central slits
- And could also do it for slit a, which has the narrowest widths because it is tangent to the barrel

* Velocity splitting measurements
:PROPERTIES:
:ID:       478343AB-FDFD-4EA9-A338-FFC7B0809E0C
:END:
- Inner shell

** Table of gaussian fits
|        pos | amplitude_0 |      mean_0 |   stddev_0 | amplitude_1 |      mean_1 |   stddev_1 | delta V | Average      |        |
|------------+------------+------------+-----------+------------+------------+-----------+---------+--------------+--------|
| -28.000000 |   0.011767 | -51.409848 |  5.000000 |   0.009831 | -31.620553 |  5.000000 |   19.79 |              |        |
| -27.000000 |   0.009380 | -50.959859 |  5.000000 |   0.015257 | -29.202672 |  7.820793 |   21.76 |              |        |
| -26.000000 |   0.010536 | -59.988478 |  5.000000 |   0.022990 | -30.050188 |  9.023804 |   29.94 |              |        |
| -25.000000 |   0.006714 | -62.667483 |  7.580234 |   0.030755 | -27.191687 |  7.050812 |   35.48 |              |        |
| -24.000000 |   0.007365 | -64.547330 |  8.460510 |   0.034655 | -26.583382 |  8.471617 |   37.96 |              |        |
| -23.000000 |   0.008219 | -62.576151 |  7.243100 |   0.031853 | -28.449855 |  8.681308 |   34.13 |              |        |
| -22.000000 |   0.013606 | -64.211155 | 10.000000 |   0.024493 | -27.277620 |  9.407282 |   36.93 |              |        |
| -21.000000 |   0.004972 | -79.947702 | 10.000000 |   0.018673 | -27.697269 | 10.000000 |   52.25 |              |        |
| -20.000000 |   0.007884 | -57.312478 | 10.000000 |   0.017301 | -22.910532 | 10.000000 |   34.40 |              |        |
| -19.000000 |   0.005546 | -61.638008 |  8.951309 |   0.015957 | -21.726821 | 10.000000 |   39.91 |              |        |
| -18.000000 |   0.012457 | -62.732726 |  6.622631 |   0.016567 | -23.765660 | 10.000000 |   38.97 |              |        |
| -17.000000 |   0.016837 | -60.403444 |  6.219159 |   0.016905 | -19.329141 | 10.000000 |   41.07 |              |        |
| -16.000000 |   0.011722 | -61.867691 |  5.784890 |   0.021705 | -20.540119 |  7.964359 |   41.33 |              |        |
| -15.000000 |   0.017255 | -54.737666 |  8.477263 |   0.027205 | -17.584698 |  6.427508 |   37.15 | 38.6 +/- 1.1 |        |
| -14.000000 |   0.036463 | -56.027600 |  6.946972 |   0.031124 | -19.048401 |  6.843040 |   36.98 |              |        |
| -13.000000 |   0.051972 | -54.938285 |  6.591733 |   0.050919 | -18.560459 |  7.206244 |   36.38 |              |        |
| -12.000000 |   0.060545 | -54.030817 |  6.604743 |   0.077720 | -18.822944 |  7.147521 |   35.21 |              |        |
| -11.000000 |   0.063194 | -52.193853 |  6.863608 |   0.104665 | -19.434053 |  7.780877 |   32.76 |              |        |
| -10.000000 |   0.059050 | -50.585957 |  7.440212 |   0.105154 | -19.897408 |  8.568709 |   30.69 |              |        |
|  -9.000000 |   0.069391 | -48.235022 |  8.066568 |   0.117347 | -21.684178 |  9.830159 |   26.55 |              |        |
|  -8.000000 |   0.128020 | -45.617923 |  8.241859 |   0.155183 | -22.491162 |  8.872908 |   23.13 |              |        |
|  -7.000000 |   0.218116 | -44.782091 |  7.701405 |   0.259908 | -23.166811 |  7.257838 |   21.62 | 22.5 +/- 0.4 | Min    |
|  -6.000000 |   0.354809 | -46.052698 |  7.414679 |   0.440875 | -23.339694 |  6.886291 |   22.71 |              |        |
|  -5.000000 |   0.496532 | -47.196403 |  7.543343 |   0.604980 | -22.493281 |  6.711966 |   24.70 |              |        |
|  -4.000000 |   0.602402 | -47.785995 |  7.622638 |   0.702383 | -21.258329 |  6.676857 |   26.53 |              |        |
|  -3.000000 |   0.657590 | -47.681435 |  7.324118 |   0.808934 | -20.348132 |  6.780991 |   27.33 | 26.8 +/- 0.2 | Max    |
|  -2.000000 |   0.653930 | -47.083568 |  7.358067 |   0.879006 | -20.409675 |  6.722429 |   26.67 |              |        |
|  -1.000000 |   0.673666 | -46.551130 |  7.545827 |   0.908826 | -20.761022 |  6.904487 |   25.79 |              |        |
|   0.000000 |   0.737885 | -46.558229 |  7.254699 |   0.976014 | -21.879182 |  7.014076 |   24.68 | 25.1 +/- 0.4 | Center |
|   1.000000 |   0.701104 | -47.366795 |  7.482931 |   0.950736 | -22.656976 |  7.341171 |   24.71 |              |        |
|   2.000000 |   0.664834 | -48.670751 |  7.555740 |   0.916426 | -22.525888 |  7.548364 |   26.14 |              |        |
|   3.000000 |   0.653046 | -49.465962 |  7.673783 |   0.892476 | -22.119500 |  7.103915 |   27.35 |              |        |
|   4.000000 |   0.622532 | -49.489165 |  7.524164 |   0.936258 | -21.839362 |  6.630938 |   27.65 | 27.3 +/- 0.2 | Max    |
|------------+------------+------------+-----------+------------+------------+-----------+---------+--------------+--------|
|   5.000000 |   0.563308 | -48.818237 |  7.443582 |   0.873810 | -21.884180 |  6.585550 |   26.93 |              |        |
|   6.000000 |   0.480291 | -47.598519 |  7.116575 |   0.706541 | -22.987900 |  6.794918 |   24.61 |              |        |
|   7.000000 |   0.346506 | -45.851114 |  7.479770 |   0.522831 | -24.527363 |  6.801851 |   21.32 |              |        |
|   8.000000 |   0.210738 | -45.790896 |  8.329459 |   0.370147 | -25.634310 |  7.251770 |   20.16 | 21.4 +/- 0.7 | Min    |
|   9.000000 |   0.105767 | -48.006351 |  9.732100 |   0.227391 | -25.432634 |  8.214311 |   22.57 |              |        |
|  10.000000 |   0.076042 | -52.577306 |  9.111120 |   0.161030 | -24.612157 |  8.451674 |   27.97 |              |        |
|  11.000000 |   0.073336 | -54.672559 |  8.368737 |   0.145091 | -24.179844 |  8.655543 |   30.49 |              |        |
|  12.000000 |   0.068193 | -54.942853 |  8.043460 |   0.147864 | -23.933850 |  8.143172 |   31.01 |              |        |
|  13.000000 |   0.047375 | -57.326225 |  9.001146 |   0.134590 | -24.253194 |  7.956009 |   33.07 |              |        |
|  14.000000 |   0.029443 | -59.146989 | 10.000000 |   0.116693 | -23.640636 |  7.216673 |   35.51 |              |        |
|  15.000000 |   0.021535 | -60.996208 | 10.000000 |   0.096765 | -22.886628 |  6.599190 |   38.11 | 35.3 +/- 0.9 |        |
|  16.000000 |   0.027256 | -59.693720 | 10.000000 |   0.070094 | -23.849911 |  7.816596 |   35.84 |              |        |
|  17.000000 |   0.029066 | -59.413037 | 10.000000 |   0.061837 | -25.596553 |  8.900597 |   33.82 |              |        |
|  18.000000 |   0.024423 | -55.684637 | 10.000000 |   0.050882 | -26.572591 |  9.967609 |   29.11 |              |        |
|  19.000000 |   0.026548 | -52.896122 | 10.000000 |   0.035906 | -28.001443 | 10.000000 |   24.89 |              |        |
|  20.000000 |   0.036882 | -46.380165 | 10.000000 |   0.019621 | -22.019067 |  6.200113 |   24.36 |              |        |
|  21.000000 |   0.035641 | -43.145101 | 10.000000 |   0.018866 | -24.027183 |  7.610798 |   19.12 |              |        |
|  22.000000 |   0.031974 | -40.950975 | 10.000000 |   0.020888 | -30.664625 | 10.000000 |   10.29 |              |        |
|  23.000000 |   0.025699 | -39.519881 | 10.000000 |   0.026363 | -32.788411 |  8.853190 |    6.73 |              |        |
|  24.000000 |   0.029958 | -39.996721 | 10.000000 |   0.022451 | -32.040898 |  7.330299 |    7.96 |              |        |
|  25.000000 |   0.033677 | -39.647957 | 10.000000 |   0.014556 | -30.494266 | 10.000000 |    9.15 |              |        |
|  26.000000 |   0.026356 | -45.246445 | 10.000000 |   0.015359 | -27.853046 | 10.000000 |   17.39 |              |        |
|  27.000000 |   0.023160 | -43.016615 | 10.000000 |   0.008366 | -15.379267 |  9.248470 |   27.64 |              |        |
|  28.000000 |   0.011795 | -49.776702 | 10.000000 |   0.011152 | -32.027969 | 10.000000 |   17.75 |              |        |
#+TBLFM: $8=$6-$3;f2::@15$9=vmeane(@-2$-1..@+2$-1);f1::@23$9=vmeane(@-1$-1..@+1$-1);f1::@27$9=vmeane(@-1$-1..@+1$-1);f1::@30$9=vmeane(@-1$-1..@+1$-1);f1::@34$9=vmeane(@-1$-1..@+1$-1);f1::@38$9=vmeane(@-1$-1..@+1$-1);f1::@45$9=vmeane(@-2$-1..@+2$-1);f1


* He II emission
+ We have lots of observations of the He II 6560 line
+ We could compare this with the Ha emission to get the ratio of ionizing photons in the two continua
+ But the trouble with that is that it is not clear if the H+ continuum is optically thick.
  + The [N II] emission is very weak, suggesting it might be thin
+ Alternatively, we could just find a He++ Zanstra temperature
  + How does that work exactly?
  + It requires knowledge of the continuum flux from the star at some reference wavelength, which we cannot do easily in this case because it is a binary
  + We would have to extract it from the light curve somehow, and this will be difficult since most of the flux comes from the cool component I think



* Co-added spectra
+ We can add together all the slits that are close to the axis of the nebula, in order to get better signal-to-noise
+ This should work fine, since we have very little variation across the minor axis
